export default function Footer() {
  return (
    <footer class="foot">
      <div class="foot__warn">
        <b>Предупреждение корпорации INFROCore</b>
        <p>Технология Tek-Core находится на стадии активных исследований. Передача объектов по сети допустима только для предметов, одобренных руководством по эксплуатации. Запрещено передавать живые организмы, опасные и запрещённые вещества, а также использовать несертифицированные компоненты и вскрывать корпус ядра-узла. Корпорация не несёт ответственности за ущерб, возникший при нарушении инструкций. Перед развёртыванием сети внимательно изучите руководство.</p>
      </div>
      <small>
        © 2026 INFROCore. Tek-Core и «Тэк-Ядро» — товарные знаки корпорации. <br></br>
        Сайт <a href="/" style="text-decoration: underline">Alex 'jiene' Jienexa</a>. Тэк-Ядро и корпорация INFROCore являются частью моего сеттинга Наноград для SF2e. Каюсь, навайбкодил, но бля с таким удовольствием.
      </small>
      <small style="padding-top: 10px"></small>
    </footer>
  );
}
